IDEA StatiCa Open Model
PolyLine3D.Segments Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 Gets or sets list of references to Segment3D of PolyLine3D.
 Namespace: IdeaRS.OpenModel.Geometry3D
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public List<ReferenceElement> Segments { get; set; }
Public Property Segments As List(Of ReferenceElement)
	Get
	Set
public:
property List<ReferenceElement^>^ Segments {
	List<ReferenceElement^>^ get ();
	void set (List<ReferenceElement^>^ value);
}
Property Value
Type: List<ReferenceElement>
See Also
Reference
PolyLine3D Class
IdeaRS.OpenModel.Geometry3D Namespace